public/programming/wishlist.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="programming.html">Programming</a> &gt;
</p>

<div id="outline-container-org06d929d" class="outline-2">
<h2 id="org06d929d">Wishlist&#xa0;&#xa0;&#xa0;<span class="tag"><span class="programming">programming</span></span></h2>
<div class="outline-text-2" id="text-org06d929d">
</div>

<div id="outline-container-orga2f3ab2" class="outline-3">
<h3 id="orga2f3ab2">Coding</h3>
<div class="outline-text-3" id="text-orga2f3ab2">
</div>
<div id="outline-container-orga56efec" class="outline-4">
<h4 id="orga56efec"><span class="todo TODO">TODO</span> Simple filesystem inspired by ext2</h4>
<div class="outline-text-4" id="text-orga56efec">
<p>
Write a linux filesystem inspired by ext2, this should be really fun.
</p>
</div>
</div>

<div id="outline-container-org1297b08" class="outline-4">
<h4 id="org1297b08"><span class="todo TODO">TODO</span> Write a database</h4>
<div class="outline-text-4" id="text-org1297b08">
<p>
First, write an in memory databse in C like redis as a warmup.
When you feel ready, write a proper databse with permanent
storage.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf123907" class="outline-3">
<h3 id="orgf123907">Blog Posts</h3>
<div class="outline-text-3" id="text-orgf123907">
</div>
<div id="outline-container-org10d3097" class="outline-4">
<h4 id="org10d3097"><span class="todo TODO">TODO</span> On AI</h4>
<div class="outline-text-4" id="text-org10d3097">
<p>
Write down my whoughts on using AI, from a philosophical, moral and
practical point of view. I have much to say here
</p>
</div>
</div>

<div id="outline-container-org90264ba" class="outline-4">
<h4 id="org90264ba"><span class="todo TODO">TODO</span> What is a variable?</h4>
<div class="outline-text-4" id="text-org90264ba">
<p>
I went on a pretty big tangent a while ago about the question "what
is a variable?". A truly safisfying and correct answer would require
a book probably, I want to write what I have found.
</p>
</div>
</div>

<div id="outline-container-org9098558" class="outline-4">
<h4 id="org9098558"><span class="todo TODO">TODO</span> tiny-rss</h4>
<div class="outline-text-4" id="text-org9098558">
<p>
Document <code>tiny-rss</code>, my own RSS feed generator once It is ready and
tested.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd08dc11" class="outline-3">
<h3 id="orgd08dc11">Misc</h3>
<div class="outline-text-3" id="text-orgd08dc11">
</div>
<div id="outline-container-org4811dc4" class="outline-4">
<h4 id="org4811dc4"><span class="todo TODO">TODO</span> Install linux 6.14</h4>
<div class="outline-text-4" id="text-org4811dc4">
<p>
Finally linux 6.14 is out and I can upgrade. The best thing is
that they added new syncronization primitives compatible with
windows so that emulators / translators do not need to emulate
them. This increases FPS by a lot, in one example It reaches
+600%. I use wine / proton sometimes so I am really happy of
this change.
Maybe It would be interesting to do some performance evaluations
and write my findings.
</p>
</div>
</div>

<div id="outline-container-org6bde4a1" class="outline-4">
<h4 id="org6bde4a1"><span class="todo TODO">TODO</span> Install FreeBSD on my laptop</h4>
<div class="outline-text-4" id="text-org6bde4a1">
<p>
There is an ongoing effort to bring laptop support in FreeBSD.
I want to see If I can help by testing on my hardware and
supporting developers.
</p>

<hr />

<p>
Travel: <a href="programming.html">Programming</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
